'''
默认参数

调用函数时，如果没有传递参数，则会使用默认参数。
'''


def printinfo(name='xiaoli', age=35):
    "打印任何传入的字符串"
    print("名字: ", name)
    print("年龄: ", age)
    return

s = "runoob1"
# 调用printinfo函数
printinfo(age=50)
print("------------------------")
printinfo(name=s)

student_27 = ["肖玉成", "徐帆", "彭星辉", "谭家伟", "张宏伟", "周雪梅", "万礼武", "于世龙", "武辉", "彭星荣", "曹星", "欧周华", "黄增高", "邓远洋", "尚培罡",
              "鈡明", "陈明曦", "宋飞影", "周子翔", "石远金", "甘宇鹏", "杨文汉"
    , "张逸", "薛羽", "林明和", "陈福成", "许则和", "杨顺", "刘岳彩", "张晓鹏", "张修瑜", "陈万", "凌云锋", "杨壹民", "邓嘉伟", "刘毅", "徐勇", "黄海钧", "范仲龙"]
