'''
=	简单的赋值运算符	c = a + b 将 a + b 的运算结果赋值为 c
+=	加法赋值运算符	c += a 等效于 c = c + a
-=	减法赋值运算符	c -= a 等效于 c = c - a
*=	乘法赋值运算符	c *= a 等效于 c = c * a
/=	除法赋值运算符	c /= a 等效于 c = c / a
%=	取模赋值运算符	c %= a 等效于 c = c % a
**=	幂赋值运算符	c **= a 等效于 c = c ** a
//=	取整除赋值运算符	c //= a 等效于 c = c // a
'''

# 一个等于是赋值 ,二个等于才是 恒等于

a = 21
b = 10
c = 0

c = a + b
print("a + b 的值为：", c)

c += a  # 31 + 21
print("c += a 的值为：", c)

c *= a  # 52 * 21
print("c *= a 的值为：", c)

c /= a  #
print("c /= a 的值为：", c)

c = 2
c %= a
print("c %= a 的值为：", c)

c **= a
print("c **= a 的值为：", c)

c //= a
print("c //= a 的值为：", c)